Repository: ramisli23/konnectiFly
Catalog: lib/l10n/app_*.arb
Languages: ar, es, zh

source: Get Started
ar: ابدأ
es: Comenzar
zh: 开始

# createFreeAccount
source: Create a free account
ar: إنشاء حساب مجاني
es: Crear cuenta gratuita
zh: 创建免费账户

source: Full name
ar: الاسم الكامل
es: Nombre completo
zh: 全名

# validEmail
source: Enter a valid email
ar: أدخل بريدًا إلكترونيًا صالحًا
es: Ingrese un correo electrónico válido
zh: 请输入有效的电子邮件

source: Phone number
ar: رقم الهاتف
es: Número de teléfono
zh: 电话号码

source: Strong password
ar: كلمة مرور قوية
es: Contraseña segura
zh: 安全密码

# agreeToTerms
source: I agree to the
ar: أوافق على
es: Acepto los
zh: 我同意

# terms
source: Terms and Conditions
ar: الشروط والأحكام
es: Términos y Condiciones
zh: 服务条款

source: and
ar: و
es: y
zh: 和

source: Conditions
ar: الأحكام
es: Condiciones
zh: 条件

source: Next
ar: التالي
es: Siguiente
zh: 下一步

# alreadyMember
source: Already a member?
ar: هل أنت عضو بالفعل؟
es: ¿Ya eres miembro?
zh: 已经是会员？

source: Login
ar: تسجيل الدخول
es: Iniciar sesión
zh: 登录

source: Welcome back
ar: مرحبًا بعودتك
es: Bienvenido de nuevo
zh: 欢迎回来

# signInToAccess
source: Sign in to access your account
ar: قم بتسجيل الدخول للوصول إلى حسابك
es: Inicie sesión para acceder a su cuenta
zh: 登录以访问您的账户

source: New member?
ar: عضو جديد؟
es: ¿Nuevo miembro?
zh: 新会员？

source: Register now
ar: سجل الآن
es: Regístrate ahora
zh: 立即注册

# enterEmail
source: Enter your email
ar: أدخل البريد الإلكتروني
es: Ingrese su correo electrónico
zh: 输入电子邮件

source: Password
ar: كلمة المرور
es: Contraseña
zh: 密码

source: Remember me
ar: تذكرني
es: Recuérdame
zh: 记住我

# forgetPassword
source: Forgot password?
ar: نسيت كلمة المرور؟
es: ¿Olvidaste la contraseña?
zh: 忘记密码？

# loginSuccess
source: Login successful
ar: تم تسجيل الدخول بنجاح
es: Inicio de sesión exitoso
zh: 登录成功

# welcomeText
source: Welcome to Turkey 🇹🇷
ar: مرحبًا بكم في تركيا 🇹🇷
es: Bienvenido a Turquía 🇹🇷
zh: 欢迎来到土耳其 🇹🇷

# searchHint
source: Search the desired section...
ar: ابحث عن القسم المطلوب...
es: Buscar la sección deseada...
zh: 搜索所需的部分...

source: My eSIM
ar: eSIM الخاصة بي
es: Mi eSIM
zh: 我的eSIM

source: Data
ar: بيانات
es: Datos
zh: 数据

# call
source: Calls
ar: مكالمات
es: Llamadas
zh: 通话

source: SMS
ar: رسائل
zh: 短信

source: Total data
ar: إجمالي البيانات
es: Datos totales
zh: 总数据

source: Total minutes
ar: إجمالي الدقائق
es: Minutos totales
zh: 总通话时间

source: Total SMS
ar: إجمالي الرسائل
es: SMS totales
zh: 总短信

source: Conversation
ar: محادثة
es: Conversación
zh: 会话

source: Offers
ar: عروض
es: Ofertas
zh: 优惠

# downloadsLabel
source: Downloads
ar: التنزيلات
es: Descargas
zh: 下载量

# downloadsTitle
source: Konnecti for easy travel connectivity
ar: Konnecti للاتصال السهل أثناء السفر
es: Konnecti para conectividad fácil en viajes
zh: Konnecti，轻松旅行连接

# downloadsSubtitle
source: Konnecti - Fast and affordable connectivity
ar: Konnecti - اتصال سريع وبأسعار معقولة
es: Konnecti - Conectividad rápida y asequible
zh: Konnecti - 快速且实惠的连接方式

# dataOnly
source: Data only Konnecti
ar: بيانات فقط Konnecti
es: Solo Datos Konnecti
zh: 仅数据 Konnecti

# dataVoice
source: Data + Calls Konnecti
ar: بيانات + مكالمات Konnecti
es: Datos + Llamadas Konnecti
zh: 数据 + 通话 Konnecti

source: Local eSIMs
ar: eSIMs محلية
es: eSIMs locales
zh: 本地eSIMs

source: Regional eSIMs
ar: eSIMs إقليمية
es: eSIMs regionales
zh: 区域eSIMs

source: Global eSIMs
ar: eSIMs عالمية
es: eSIMs globales
zh: 全球eSIMs

# globalComingSoon
source: Global eSIMs coming soon...
ar: eSIMs عالمية قادمة قريبًا...
es: eSIMs globales próximamente...
zh: 全球eSIMs即将推出...

# exploreEsimsTitle
source: Discover our range of eSIMs for over 200 destinations
ar: اكتشف مجموعة eSIMs لدينا لأكثر من 200 وجهة
es: Descubra nuestra gama de eSIMs para más de 200 destinos
zh: 探索我们的eSIMs，覆盖200多个目的地

source: Starts from
ar: يبدأ من
es: Desde
zh: 起价

# regionalEsimSubtitle
source: Discover regional eSIMs in different regions
ar: استكشف eSIMs الإقليمية في مناطق مختلفة
es: Descubra eSIMs regionales en diferentes regiones
zh: 探索不同地区的区域eSIMs

source: Back
ar: عودة
es: Atrás
zh: 返回

# offersTitle
source: Available offers for
ar: العروض المتاحة
es: Ofertas disponibles
zh: 可用优惠

source: Share
ar: مشاركة
es: Compartir
zh: 分享

# shareWithFriends
source: Share with your friends and family
ar: شارك مع أصدقائك وعائلتك
es: Comparte con tus amigos y familiares
zh: 与您的朋友和家人分享

source: Create tickets
ar: إنشاء تذاكر
es: Crear tickets
zh: 创建票据

# generateTickets
source: Please generate tickets here
ar: يرجى إنشاء التذاكر هنا
es: Por favor genere tickets aquí
zh: 请在此生成票据

source: Languages
ar: اللغات
es: Idiomas
zh: 语言

# chooseLanguages
source: Choose from 8 languages to connect
ar: اختر من بين 8 لغات لتسجيل الدخول
es: Elija entre 8 idiomas para conectarse
zh: 选择8种语言登录

# readTerms
source: Read our Terms and Conditions
ar: اقرأ الشروط والأحكام الخاصة بنا
es: Lea nuestros Términos y Condiciones
zh: 阅读我们的服务条款

# privacy
source: Privacy Policy
ar: سياسة الخصوصية
es: Política de privacidad
zh: 隐私政策

# readPrivacy
source: Read our Privacy Policy
ar: اقرأ سياسة الخصوصية الخاصة بنا
es: Lea nuestra Política de Privacidad
zh: 阅读我们的隐私政策

source: Contact
ar: اتصل بنا
es: Contacto
zh: 联系

# getHelp
source: Get help from our agents
ar: احصل على المساعدة من وكلائنا
es: Obtenga ayuda de nuestros agentes
zh: 获取我们的帮助

source: Delete account
ar: حذف الحساب
es: Eliminar cuenta
zh: 删除账户

# deleteHelp
source: We are here to help you
ar: نحن هنا لمساعدتك
es: Estamos aquí para ayudar
zh: 我们随时为您提供帮助

source: Logout
ar: تسجيل الخروج
es: Cerrar sesión
zh: 登出

# missed
source: We will miss you
ar: سوف نفتقدك
es: Te vamos a extrañar
zh: 我们会想念您

source: Change photo
ar: تغيير الصورة
es: Cambiar foto
zh: 更改照片

# terms1Title
source: 1. Introduction
ar: 1. المقدمة
es: 1. Introducción
zh: 1. 介绍

# terms1Content
source: Welcome to our eSIM service. These Terms and Conditions govern your access and use of our digital SIM card (eSIM) services. By purchasing or activating an eSIM, you agree to be bound by these Terms.
ar: مرحبًا بكم في خدمة eSIM الخاصة بنا. تحكم هذه الشروط والأحكام وصولك واستخدامك لخدمات بطاقة SIM الرقمية (eSIM). من خلال شراء أو تفعيل eSIM، فإنك توافق على الالتزام بهذه الشروط.
es: Bienvenido a nuestro servicio eSIM. Estos Términos y Condiciones regulan su acceso y uso de nuestros servicios de tarjeta SIM digital (eSIM). Al comprar o activar una eSIM, acepta estar sujeto a estos Términos.
zh: 欢迎使用我们的eSIM服务。这些服务条款管理您对我们数字SIM(eSIM)服务的访问和使用。购买或激活eSIM即表示您同意受这些条款约束。

# terms2Title
source: 2. Definitions
ar: 2. التعريفات
es: 2. Definiciones
zh: 2. 定义

# terms2Content
source: eSIM: An embedded SIM card downloaded and activated digitally. User: The person who purchases and/or activates the eSIM. Service provider: The mobile operator or reseller offering the eSIM. Device: A mobile device compatible with eSIM technology.
ar: eSIM: بطاقة SIM مدمجة يتم تنزيلها وتفعيلها رقميًا. المستخدم: الشخص الذي يشتري و/أو يفعل eSIM. مزود الخدمة: مشغل الهاتف المحمول أو البائع الذي يقدم eSIM. الجهاز: جهاز محمول متوافق مع تقنية eSIM.
es: eSIM: Una tarjeta SIM integrada descargada y activada digitalmente. Usuario: La persona que compra y/o activa la eSIM. Proveedor de servicios: El operador móvil o revendedor que ofrece la eSIM. Dispositivo: Un dispositivo móvil compatible con la tecnología eSIM.
zh: eSIM：嵌入式SIM，可数字下载和激活。 用户：购买和/或激活eSIM的人。 服务提供商：提供eSIM的移动运营商或经销商。 设备：支持eSIM技术的移动设备。

# terms3Title
source: 3. Eligibility
ar: 3. الأهلية
es: 3. Elegibilidad
zh: 3. 使用资格

# terms3Content
source: To use the eSIM service, you must: Own an eSIM-compatible device. Have an active Internet connection during activation. Be legally capable of entering into a binding contract.
ar: لاستخدام خدمة eSIM، يجب أن: تمتلك جهازًا متوافقًا مع eSIM. تكون متصلًا بالإنترنت أثناء التفعيل. تكون قادرًا قانونيًا على الدخول في عقد ملزم.
es: Para usar el servicio eSIM, debe: Poseer un dispositivo compatible con eSIM. Tener conexión a Internet activa durante la activación. Ser legalmente capaz de celebrar un contrato vinculante.
zh: 使用eSIM服务，您必须： 拥有支持eSIM的设备。 激活时保持互联网连接。 有法律能力签署具有约束力的合同。

# terms4Title
source: 4. Service activation
ar: 4. تفعيل الخدمة
es: 4. Activación del servicio
zh: 4. 服务激活

# terms4Content
source: The eSIM QR codes and activation instructions will be provided after purchase. Activation may take from a few minutes to several hours depending on the operator. The user is responsible for providing the correct device information.
ar: سيتم تزويدك برموز QR الخاصة بـ eSIM وتعليمات التفعيل بعد الشراء. قد يستغرق التفعيل من بضع دقائق إلى عدة ساعات حسب المشغل. المستخدم مسؤول عن تقديم معلومات الجهاز الصحيحة.
es: Se proporcionarán los códigos QR de eSIM y las instrucciones de activación después de la compra. La activación puede tardar desde unos minutos hasta varias horas según el operador. El usuario es responsable de proporcionar la información correcta del dispositivo.
zh: 购买后将提供eSIM二维码和激活说明。 激活可能需要几分钟到几小时，取决于运营商。 用户需提供正确的设备信息。

# terms5Title
source: 5. Use of the service
ar: 5. استخدام الخدمة
es: 5. Uso del servicio
zh: 5. 服务使用

# terms5Content
source: The eSIM is for personal use only and must not be resold, reused, or transferred without authorization. The user agrees not to misuse or use the service illegally. Voice and data plans are subject to the provider’s limitations and fair use policy.
ar: eSIM للاستخدام الشخصي فقط ولا يجوز إعادة بيعها أو إعادة استخدامها أو نقلها بدون إذن. يوافق المستخدم على عدم سوء استخدام الخدمة أو استخدامها بشكل غير قانوني. خطط المكالمات والبيانات تخضع لقيود مزود الخدمة وسياسة الاستخدام العادل.
es: La eSIM es solo para uso personal y no debe revenderse, reutilizarse ni transferirse sin autorización. El usuario acepta no hacer un uso indebido o ilegal del servicio. Los planes de voz y datos están sujetos a las limitaciones del proveedor y a la política de uso justo.
zh: eSIM仅供个人使用，未经授权不得转售、再利用或转移。 用户不得滥用或非法使用服务。 语音和数据套餐受提供商公平使用政策限制。

# terms6Title
source: 6. Pricing and payments
ar: 6. التسعير والدفع
es: 6. Precios y pagos
zh: 6. 价格与付款

# terms6Content
source: All prices are stated in the specified currency and may include applicable taxes. Payments are non-refundable unless otherwise stated. Once activated, the eSIM cannot be transferred to another device or account.
ar: جميع الأسعار موضحة بالعملة المحددة وقد تشمل الضرائب المطبقة. المدفوعات غير قابلة للاسترداد ما لم يُذكر خلاف ذلك. بمجرد التفعيل، لا يمكن نقل eSIM إلى جهاز أو حساب آخر.
es: Todos los precios se indican en la moneda especificada y pueden incluir impuestos aplicables. Los pagos no son reembolsables, salvo que se indique lo contrario. Una vez activada, la eSIM no se puede transferir a otro dispositivo o cuenta.
zh: 所有价格以所示货币为准，可能包含适用税费。 除非另有说明，付款不予退还。 激活后，eSIM不能转移到其他设备或账户。

# privacyPolicyTitle
source: Privacy Policy
ar: سياسة الخصوصية
es: Política de privacidad
zh: 隐私政策

# privacy1Title
source: 1. Information we collect
ar: 1. المعلومات التي نجمعها
es: 1. Información que recopilamos
zh: 1. 我们收集的信息

# privacy1a
source: a. Personal information
ar: أ. المعلومات الشخصية
es: a. Información personal
zh: a. 个人信息

# privacy1aList
source: Full name Email address Phone number Billing address Payment information (handled by a third party)
ar: الاسم الكامل عنوان البريد الإلكتروني رقم الهاتف عنوان الفواتير معلومات الدفع (تدار بواسطة طرف ثالث)
es: Nombre completo Dirección de correo electrónico Número de teléfono Dirección de facturación Información de pago (gestionada por un tercero)
zh: 全名 电子邮件地址 电话号码 账单地址 支付信息（由第三方管理）

# privacy1b
source: b. Device information
ar: ب. معلومات الجهاز
es: b. Información del dispositivo
zh: b. 设备信息

# privacy1bList
source: Device model and brand Operating system IMEI or eSIM compatible ID (if required)
ar: طراز الجهاز والعلامة التجارية نظام التشغيل IMEI أو معرف متوافق مع eSIM (إذا لزم الأمر)
es: Modelo y marca del dispositivo Sistema operativo IMEI o ID compatible con eSIM (si se requiere)
zh: 设备型号和品牌 操作系统 IMEI或支持eSIM的ID（如需）

# privacy1c
source: c. Usage data
ar: ج. بيانات الاستخدام
es: c. Datos de uso
zh: c. 使用数据

# privacy1cList
source: Activation date and time Data usage statistics IP address Location data (compliance and fraud prevention)
ar: تاريخ ووقت التفعيل إحصاءات استخدام البيانات عنوان IP بيانات الموقع (لأغراض الامتثال ومنع الاحتيال)
es: Fecha y hora de activación Estadísticas de uso de datos Dirección IP Datos de ubicación (cumplimiento y prevención de fraudes)
zh: 激活日期和时间 数据使用统计 IP地址 位置数据（合规和防欺诈）

# privacy2Title
source: 2. How we use your information
ar: 2. كيفية استخدام معلوماتك
es: 2. Cómo usamos su información
zh: 2. 我们如何使用您的信息

# privacy2Body
source: We use your data to: • Activate your eSIM • Provide our services and customer support • Send notifications • Prevent fraud • Comply with laws • Improve our services
ar: نستخدم بياناتك لـ: • تفعيل eSIM الخاص بك • تقديم خدماتنا ودعم العملاء • إرسال الإشعارات • منع الاحتيال • الامتثال للقوانين • تحسين خدماتنا
es: Usamos sus datos para: • Activar su eSIM • Proporcionar nuestros servicios y soporte al cliente • Enviar notificaciones • Prevenir fraudes • Cumplir con la ley • Mejorar nuestros servicios
zh: 我们使用您的数据来： • 激活您的eSIM • 提供服务和客户支持 • 发送通知 • 防止欺诈 • 遵守法律 • 改进服务

# privacy3Title
source: 3. Sharing your information
ar: 3. مشاركة معلوماتك
es: 3. Compartir su información
zh: 3. 分享您的信息

# privacy3Body
source: We may share your data with: • Mobile operators • Payment processors • Service providers • Authorities (if required by law) We do not sell your data.
ar: قد نشارك بياناتك مع: • مشغلي الهاتف المحمول • معالجي الدفع • مقدمي الخدمة • السلطات (إذا كان مطلوبًا بموجب القانون) نحن لا نبيع بياناتك.
es: Podemos compartir sus datos con: • Operadores móviles • Procesadores de pagos • Proveedores de servicios • Autoridades (si lo requiere la ley) No vendemos sus datos.
zh: 我们可能会与以下方共享您的数据： • 移动运营商 • 支付处理商 • 服务提供商 • 法律要求的当局 我们不会出售您的数据。

# privacy4Title
source: 4. Data storage and security
ar: 4. تخزين البيانات والأمان
es: 4. Almacenamiento y seguridad de datos
zh: 4. 数据存储与安全

# privacy4Body
source: Your data is protected with encryption technologies. We use firewalls and secure servers.
ar: يتم حماية بياناتك باستخدام تقنيات التشفير. نحن نستخدم جدران حماية وخوادم آمنة.
es: Sus datos están protegidos con tecnologías de cifrado. Usamos cortafuegos y servidores seguros.
zh: 您的数据通过加密技术保护。我们使用防火墙和安全服务器。

# privacy5Title
source: 5. Your rights
ar: 5. حقوقك
es: 5. Sus derechos
zh: 5. 您的权利

# privacy5Body
source: You can request access, correction, or deletion of your data. Contact us at: support@yourdomain.com
ar: يمكنك طلب الوصول إلى بياناتك أو تصحيحها أو حذفها. اتصل بنا على: support@yourdomain.com
es: Puede solicitar acceso, corrección o eliminación de sus datos. Contáctenos en: support@yourdomain.com
zh: 您可以请求访问、更正或删除您的数据。联系：support@yourdomain.com

# privacy6Title
source: 6. Cookies and tracking
ar: 6. ملفات تعريف الارتباط والتتبع
es: 6. Cookies y seguimiento
zh: 6. Cookies与跟踪

# privacy6Body
source: We use cookies to analyze the site, remember your preferences, and improve functionality.
ar: نستخدم ملفات تعريف الارتباط لتحليل الموقع، وتذكر تفضيلاتك، وتحسين الوظائف.
es: Usamos cookies para analizar el sitio, recordar sus preferencias y mejorar la funcionalidad.
zh: 我们使用Cookies分析网站、记住您的偏好并改进功能。

# privacy7Title
source: 7. International transfers
ar: 7. التحويلات الدولية
es: 7. Transferencias internacionales
zh: 7. 国际传输

# privacy7Body
source: Your data may be transferred abroad in compliance with the law (e.g. GDPR).
ar: قد يتم نقل بياناتك إلى الخارج وفقًا للقانون (مثل GDPR).
es: Sus datos pueden transferirse al extranjero cumpliendo la ley (p.ej., GDPR).
zh: 您的数据可能依法被传输到国外（如GDPR）。

# privacy8Title
source: 8. Children’s privacy
ar: 8. خصوصية الأطفال
es: 8. Privacidad de los niños
zh: 8. 儿童隐私

# privacy8Body
source: Our services are not intended for children under 13 (or 16 depending on region).
ar: خدماتنا غير مخصصة للأطفال دون سن 13 (أو 16 حسب المنطقة).
es: Nuestros servicios no están destinados a niños menores de 13 años (o 16 según la región).
zh: 我们的服务不适用于13岁以下儿童（或某些地区16岁以下）。

# privacy9Title
source: 9. Changes to this policy
ar: 9. التغييرات على هذه السياسة
es: 9. Cambios en esta política
zh: 9. 政策更新

# privacy9Body
source: We may update this policy and notify you if necessary.
ar: قد نقوم بتحديث هذه السياسة ونخطرك إذا لزم الأمر.
es: Podemos actualizar esta política y notificarle si es necesario.
zh: 我们可能更新此政策并在必要时通知您。

# privacy10Title
source: 10. Contact us
ar: 10. اتصل بنا
es: 10. Contáctenos
zh: 10. 联系我们

# privacy10Body
source: [Company name] Email: support@yourdomain.com Phone: +123-456-7890 Address: [Your address]
ar: [اسم الشركة] البريد الإلكتروني: support@yourdomain.com الهاتف: +123-456-7890 العنوان: [عنوانك]
es: [Nombre de la empresa] Correo electrónico: support@yourdomain.com
zh: [公司名称] 电子邮件：support@yourdomain.com 电话：+123-456-7890 地址：[您的地址]
